---
kind: type
id: T:Autodesk.Revit.DB.Architecture.BreakCornerCondition
source: html/ee5a1e5e-436d-1d4d-d9ae-9569d90c231a.htm
---
# Autodesk.Revit.DB.Architecture.BreakCornerCondition

Condition on which the corner post is inserted.

## Syntax (C#)
```csharp
public enum BreakCornerCondition
```